import React from 'react';
import { StyleSheet, Text, View, Switch, Dimensions, Image, Linking, Platform, ScrollView } from 'react-native';
import { Container, Content, ListItem, Tab, Tabs, StyleProvider } from 'native-base';
import HTML from 'react-native-render-html';

import getTheme from '../native-base-theme/components';
import scmobile from '../native-base-theme/variables/scmobile';
import style, { RightList } from './Styles';

export default class ContactScreen extends React.Component {
  static navigationOptions = {
    title: 'مطبوعات الملحقية',
  };

  componentDidMount() {
    setTimeout(this._tabs.goToPage.bind(this._tabs, 1));
  }

  render() {
    return (
      <StyleProvider style={getTheme(scmobile)}>
        <Container>
          <Tabs ref={component => (this._tabs = component)} initialPage={0}>
            <Tab heading="الكلمة">
              <Attache />
            </Tab>
            <Tab heading="الآهداف">
              <Vision />
            </Tab>
          </Tabs>
        </Container>
      </StyleProvider>
    );
  }
}

class Vision extends React.Component {
  render() {
    return (
      <Content padder>
        <Text style={style.header}>الرؤية والرسالة والقيم</Text>
        <Text style={style.header}>الرؤية Vision</Text>
        <Text style={style.paragraph}>
          الرؤيةأن تكون الملحقية الثقافية السعودية في اليابان مؤسسة رائدة في دعم تأهيل كوادر سعودية متميزة تسهم في بناء مستقبل
          مشرق لبلادها
        </Text>
        <Text style={style.header}>الرسالة Mission</Text>
        <Text style={style.paragraph}>
          الرؤيةالملحقية الثقافية السعودية في اليابان مؤسسة تعمل على خلق بيئة أكاديمية تدعم تطوير الموارد البشرية السعودية في
          الجامعات والمعاهد اليابانية وتسعى لبناء جسور التواصل والتعاون بين الجامعات ومعاهد الأبحاث في البلدين الصديقين
        </Text>
        <Text style={style.header}>القيم Ethics</Text>
        <RightList number="1">المصداقية والمعاملة الحسنة</RightList>
        <RightList number="2">الجودة والإتقان</RightList>
        <RightList number="3">التميز</RightList>
        <RightList number="4">التعاون وروح الفريق</RightList>
        <RightList number="5">التعلم المستمر</RightList>
        <Text style={style.header}>{'\n'}تأسيس الملحقية</Text>
        <Text style={style.paragraph}>
          قرر مجلس الوزراء وفي جلسته المنعقدة يوم الإثنين 28 أبريل 2008م و بعد الاطلاع على محضر اللجنة الوزارية للتنظيم الإداري
          الخاص بدراسة وضع بعض الملحقيات الثقافية في الخارج التابعة لوزارة التعليم العالي وافتتاح ملحقيات جديدة في دول أخرى عدداً
          من الإجراءات والتي تضمنت فتح ملحقيات ثقافية في كل من اليابان ،جمهورية الصين الشعبية، ومملكة ماليزيا الاتحادية، وجمهورية
          الهند ، وكوريا الجنوبية، وسنغافورة، ونيوزيلندا لتكون هذه خطوة مهمة في سبيل تعزيز الشراكة الاستراتيجية متعددة المستويات
          بين المملكة العربية السعودية و اليابان.
        </Text>
        <Text style={style.header}>أهداف الملحقية</Text>
        <Text style={style.paragraph}>تنمية العلاقات الثقافية بين المملكة العربية السعودية واليابان</Text>
        <Text style={style.paragraph}>
          تطوير الموارد البشرية السعودية من خلال الإشراف على الطلاب السعوديين الدارسين في اليابان وتسهيل أمورهم في الجامعات و
          معاهد اللغة
        </Text>
        <Text style={style.paragraph}>
          نقل التكنولوجيا و العلوم من المؤسسات اليابانية والعمل على توطينها في المملكة العربية السعودية
        </Text>
        <Text style={style.paragraph}>تعزيز التعاون العلمي والأكاديمي بين الجامعات و المؤسسات السعودية واليابانية</Text>
        <Text style={style.header}>مقر الملحقية</Text>
        <Text style={style.paragraph}>
          يقع مقر الملحقية في مبنى ناكانو أساهي الذي يتكون من خمس طوابق وبمساحة 760 متر مربع في منطقة “ناكانو” القريبة من منطقة
          “شينجكو” وسط العاصمة طوكيو.
        </Text>
      </Content>
    );
  }
}

class Attache extends React.Component {
  render() {
    let w = Dimensions.get('window').width / 2;
    let width = w;
    let height = (366 / 294) * w;
    return (
      <Content padder>
        <Text style={style.header}>كلمة سعادة الملحق الثقافي السعودي في اليابان بمناسبة تعيينه</Text>
        <View style={{ flex: 1, flexDirection: 'row', justifyContent: 'center' }}>
          <Image source={require('./assets/attache2.jpg')} style={{ width, height, margin: 10 }} />
        </View>
        <Text
          style={
            style.paragraph
          }>{`أبنائي وبناتي المبتعثين والمبتعثات والدارسين على حسابهم الخاص، آمل أن تعلموا أن الملحقية الثقافية بجميع طواقمها وإمكانياتها هي بيت الخبرة السعودي في اليابان الذي يحتضنكم ويرعاكم ويرشدكم ويشجعكم ويخدمكم ويقدم كل الدعم لتذليل جميع الصعوبات التي قد تواجهكم في مساركم الدراسي من خلال ما توفره حكومة سيدي خادم الحرمين الشريفين من مميزات وتسهيلات للمبتعثين وبما يتضمنه نظام الابتعاث من مرونة ومكافآت تشجيعية تضمن لكل مبتعث جاد تحقيق طموحه وبلوغ غايته التي من أجلها ابتعث الى اليابان.

`}</Text>
        <Text
          style={
            style.paragraph
          }>{`إن المملكة مقبلة على تحول وطني من خلال الرؤية 2030 وهي رؤية طموحة وجادة وشاملة ستشكل مستقبل المملكة الزاهر بإذن الله حيث تشتمل على أهداف وبرامج ومبادرات واضحة المعالم في كافة المجالات. وقد وافقت حكومة سيدي خادم الحرمين الشريفين في جلسة مجلس الوزراء بداية شهر رمضان المبارك 1437هـ على برنامج التحول الوطني 2020 أحد البرامج المنبثقة من رؤية المملكة 2030، وبدأت الوزارات تباعاً تعلن برامجها ومبادراتها تأكيداً على مبدأ الشفافية في الرؤية. وأريد أن أشير هنا الى أن أحد أهم أهداف الرؤية 2030 هو الانتقال إلى اقتصاد المعرفة المعتمد أساسا على الإنسان المتعلم الماهر المبتكر، فأنتم أيها المبتعثون أول المعنيين بالمشاركة في تحقيق رؤية المملكة لأنكم تدرسون في اليابان بلد الابتكارات والعلم والتقنية، لذا أنصحكم بالاطلاع المعمق على الرؤية 2030 من خلال موقعها على شبكة الإنترنت خصوصا في مجال تخصصاتكم ليتناغم تحصيلكم العلمي والتقني مع أهدافها وبرامجها.

`}</Text>
        <Text
          style={
            style.paragraph
          }>{`أيها المبتعثون والمبتعثات والدارسون على حسابهم الخاص والمرافقون أنتم الشريحة أو العدسة التي ينظر من خلالها الشعب الياباني الصديق إلى بلدكم ومجتمعكم وثقافتكم وأخلاقكم فآمل أن تكونوا على مستوى المسؤولية في تمثيل بلد له تاريخ عريق ودين عظيم ومكانة وتأثير اقتصادي وسياسي عالمي.

`}</Text>
        <Text
          style={
            style.paragraph
          }>{`وحيث إن من مهام الملحقية الثقافية تقوية وتوثيق العلاقات العلمية والثقافية بين السعودية واليابان لذا فالملحقية تتطلع الى التعاون مع الجهات المختصة في البلدين لتحقيق ذلك بما يعود بالنفع على البلدين، ويرفع مستوى التفاهم، ويزيد من الناتج المعرفي المشترك، ويوثق أواصر الصداقة بين الشعبين.

`}</Text>
        <Text
          style={
            style.paragraph
          }>{`وبمناسبـة مباشـرة عملـي ملحقاً ثقافياً بسفـارة المملكـة فـي طـوكيـو ابتـداءاً من 1 / 9 / 1437هـ  يسرني أن أتقدم بجزيل الشكر والتقدير لمعالي وزير التعليم الدكتور أحمد بن محمد العيسى على هذه الثقة الكريمة التي أعتز بها وأسأل الله أن يعينني على أداء واجبها، والشكر موصول إلى سعادة سفير خادم الحرمين الشريفين لدى اليابان الأستاذ أحمد بن يونس البراك والمسؤولين في سفارة المملكة العربية السعودية باليابان ووزارة التعليم على كل ما يقدمونه من جهود لتيسير أمور الملحقية والطلاب المبتعثين في اليابان.

`}</Text>
        <Text style={style.paragraph}>{`وتقبلوا أطيب تحياتي ،،،

`}</Text>
        <Text style={style.paragraph}>{`الأستاذ الدكتور خالد بن عبدالرحمن الفرحان

`}</Text>
      </Content>
    );
  }
}
