import React from 'react';
import { StyleSheet, Text, View, Switch, Dimensions, Image, Linking, Platform } from 'react-native';
import { Container, Content, ListItem, Tab, Tabs, Button, Icon, StyleProvider } from 'native-base';
import Accordion from 'react-native-collapsible/Accordion';

import getTheme from '../native-base-theme/components';
import scmobile from '../native-base-theme/variables/scmobile';
import style from './Styles';

const sections = [
  {
    title: 'طلب تعديل البيانات الشخصية',
    answer: 'صورة من بطاقة الهوية الوطنية أو دفتر العائلة.',
    description: 'للطلاب الذين لم يحدثوا جميع بياناتهم الشخصية ومنها: (الاسم كاملا كما هو بجواز السفر، أو الحالة الاجتماعية ..)',
  },
  {
    title: 'طلب تعديل البيانات الدراسية',
    answer:
      'صورة من قرار الابتعاث وشهادة التخرج من آخر مرحلة دراسية وشهادة الانتظام بالمعهد أو الجامعة في اليابان وشهادة الدرجات إن وجدت.',
    description: 'ضرورة تعديل كافة البيانات مثل المرحلة والسنة الدراسية وتاريخ التخرج المتوقع ..',
  },
  {
    title: 'طلب تعديل بيانات جواز السفر والتأشيرة',
    answer: 'صورة من جواز السفر وبطاقة الإقامة اليابانية وختم الدخول إن وجد.',
    description: 'في حالة التعديل لأول مرة أو التعديل عند تجديد جواز السفر أو التأشيرة للمبتعثين ومرافقيهم.',
  },
  {
    title: 'طلب إضافة تقرير دراسي',
    answer: 'صورة من شهادة الدرجات أو تقرير الأستاذ المشرف (في نهاية الفصل)، وصورة من إفادة بتسجيل الساعات (في بداية الفصل)..',
    description:
      'يجب رفع هذا الطلب مرتين في الفصل الدراسي (مرة في بداية الفصل مع إرفاق ما يفيد بتسجيل الساعات)، (ومرة أخرى في نهاية الفصل مع إرفاق كشف الدرجات).',
  },
  {
    title: 'طلب إضافة/تغيير محرم (للمبتعثات) أو مرافق.',
    answer:
      'صورة من بطاقة العائلة وصورة من جواز السفر وبطاقة الإقامة اليابانية وختم الدخول للطالبة والمحرم/المرافق (أو شهادة الميلاد للمواليد الجدد)، وموافقة ولي الأمر ووكالة شرعية.',
    description: 'للمبتعثات اللاتي لم يقمن بإضافة محرم بعد أو في حالة تغيير المحرم أو إضافة مرافق جديد.',
  },
  {
    title: 'طلب استمرار في دراسة اللغة',
    answer:
      'صورة من جواز السفر وبطاقة الإقامة اليابانية وقرار الابتعاث وبطاقة الهوية الوطنية وشهادة القيد في مرحلة اللغة مبين بها فترة دراسة اللغة وكشف الدرجات ومعدل الحضور (مع إرفاق شهادات اللغة مثل JLPT وغيرها إن وجدت).',
    description:
      'يجب رفع الطلب قبل انتهاء سنة اللغة على أن تكون مدة تمديد اللغة ستة أشهر (يمكن الرفع بمدة ستة أشهر أخرى عند الضرورة) (يجب أن تكون جميع الشهادات باللغة الإنجليزية أو بالترجمة العربية).',
  },
  {
    title: ' طلب تأجيل البعثة',
    answer:
      'صورة من جواز السفر وبطاقة الإقامة اليابانية وبطاقة الهوية الوطنية وقرار الابتعاث وشهادة الانتظام في الدراسة مع إرفاق خطاب يفيد بموافقة الجامعة على تأجيل الدراسة، وإرفاق ما يفيد بسبب تأجيل البعثة.',
    description: 'التأجيل يتم لمدة 6 أشهر ويمكن النظر في التأجيل لأكثر من ذلك بحسب الضرورة.',
  },
  {
    title: 'طلب تعديل تاريخ نهاية البعثة ',
    answer:
      'صورة من جواز السفر وبطاقة الإقامة اليابانية وبطاقة الهوية الوطنية وقرار الابتعاث وشهادة التخرج من مرحلة اللغة مبين بها فترة دراسة اللغة وشهادة الانتظام بالجامعة وشهادة الدرجات إضافة إلى خطاب من الجامعة يفيد بتاريخ التخرج المتوقع.',
    description:
      'للمبتعثين الذين يستحقون تعويض عن فترة اللغة أو غير ذلك إن وجد وذلك بعد الانتقال إلى المرحلة الأكاديمية (يجب أن تكون جميع الشهادات باللغة الإنجليزية أو بالترجمة العربية).',
  },
  {
    title: 'طلب تمديد البعثة',
    answer:
      'صورة من جواز السفر وبطاقة الإقامة اليابانية وقرار الابتعاث وبطاقة الهوية الوطنية وشهادة الانتظام بالجامعة بها تاريخ التخرج المتوقع، وشهادة الدرجات (مبين بها المعدل التراكمي) وخطاب من الأستاذ المشرف يوضح ما أنجزه الطالب والمتبقي له حتى التخرج ويشرح أسباب تأخر التخرج وغير ذلك إن وجد.',
    description:
      'للمبتعثين الذين لا يستطيعون التخرج خلال المدة النظامية الممنوحة للمرحلة الأكاديمية المبتعث عليها الطالب (يجب أن تكون جميع الشهادات باللغة الإنجليزية أو بالترجمة العربية).',
  },
  {
    title: 'طلب تغيير جامعة',
    answer:
      'صورة من قرار الابتعاث وبطاقة الهوية الوطنية وصورة من جواز السفر وبطاقة الإقامة اليابانية وشهادات الانتظام والدجات من الجامعة الحالية وخطاب القبول من الجامعة المطلوب الانتقال إليها حال الحصول عليه.',
    description:
      'لا يتم قبول طلبات تغيير الجامعة إلا في أضيق الحدود وعند الضرورة وبأسباب مقنعة وموثقة (يجب أن تكون جميع الشهادات باللغة الإنجليزية أو بالترجمة العربية)؟',
  },
  {
    title: 'طلب تغيير التخصص',
    answer:
      'صورة من قرار الابتعاث وبطاقة الهوية الوطنية وصورة من جواز السفر وبطاقة الإقامة اليابانية وشهادات الانتظام والدجات من الجامعة الحالية وخطاب القبول على التخصص الجديد.',
    description:
      'لا يتم قبول طلبات تغيير التخصص إلا في أضيق الحدود وعند الضرورة وبأسباب مقنعة وموثقة (يجب أن تكون جميع الشهادات باللغة الإنجليزية أو بالترجمة العربية).',
  },
  {
    title: 'طلب حضور ندوة أو مؤتمر',
    answer:
      'صورة من جواز السفر وبطاقة الإقامة اليابانية وبطاقة الهوية الوطنية وقرار الابتعاث وشهادة الانتظام بالجامعة بها تاريخ التخرج المتوقع، وما يفيد موافقة إدارة المؤتمر على مشاركة الطالب (مع صورة من ملخص البحث الذي سيتقدم به الطالب للمؤتمر)، وموافقة الأستاذ المشرف بالجامعة على حضور الطالب للمؤتمر.',
    description:
      'لطلاب الدراسات العليا فقط، ويجب رفع الطلب قبل بداية المؤتمر بشهر على الأقل (بعد قبول الطلب يمكن للطالب رفع طلب تذكرة حضور ندوة أو مؤتمر) (يجب أن تكون جميع الشهادات باللغة الإنجليزية أو بالترجمة العربية).',
  },
  {
    title: 'طلب تذكرة',
    answer: 'صورة من جواز السفر وبطاقة الإقامة اليابانية وما يفيد بالإجازة أو موافقة الجامعة على سفر الطالب.',
    description: 'التذكرة السنوية يستحقها المبتعث كل تسعة أشهر والدارس على حسابه الخاص كل سنتين.',
  },
  {
    title: 'طلب إنهاء البعثة',
    answer:
      'صورة من جواز السفر وبطاقة الإقامة اليابانية وبطاقة الهوية الوطنية وقرار الابتعاث وشهادة التخرج وشهادة الدرجات (مبين بها المعدل التراكمي).',
    description:
      'على الطالب رفع طلب معادلة الشهادة وعلى طلاب الدراسات العليا إرسال نسخة من بحث الماجستير/ الدكتوراه إلى الملحقية.',
  },
  {
    title: 'تعديل بيانات الاتصال (بدون رفع طلب)',
    answer: 'لا يوجد',
    description:
      'ضرورة تعبئة جميع بيانات الاتصال كأرقام الهواتف والعنوان في اليابان والمملكة، والإيميل وغيرها كما هو مطلوب والحرص على تحديثها في حالة التغيير وإفادة الملحقية برسالة عند تحديث البيانات.',
  },
];

const styles = StyleSheet.create({
  header: {
    backgroundColor: 'green',
    color: 'white',
    padding: 10,
  },
  headerText: {
    ...style.arabicBold,
    textAlign: 'center',
    fontSize: 16,
    fontWeight: '500',
  },
  content: {
    ...style.arabic,
  },
});

export default class ContactScreen extends React.Component {
  static navigationOptions = {
    title: 'الشؤون الدراسية',
  };

  state = {
    activeSections: [],
  };

  _renderSectionTitle = section => {
    return (
      <View style={styles.content}>
        <Text>{section.content}</Text>
      </View>
    );
  };

  _renderHeader = section => {
    return (
      <View style={styles.header}>
        <Text style={{...style.header, color: 'white' }}>{section.title}</Text>
      </View>
    );
  };

  _renderContent = section => {
    return (
      <View style={styles.content}>
        <Text style={{...style.paragraph, ...style.arabicBold}}>{section.answer}</Text>
        <Text style={style.paragraph}>{section.description}</Text>
      </View>
    );
  };

  _updateSections = activeSections => {
    this.setState({ activeSections });
  };

  render() {
    return (
      <StyleProvider style={getTheme(scmobile)}>
        <Container>
          <Content padder>
            <Accordion
              sections={sections}
              activeSections={this.state.activeSections}
              renderSectionTitle={this._renderSectionTitle}
              renderHeader={this._renderHeader}
              renderContent={this._renderContent}
              onChange={this._updateSections}
            />
          </Content>
        </Container>
      </StyleProvider>
    );
  }
}
