import React from 'react';
import { StyleSheet, Text, View, Switch, Dimensions, Image, Linking, Platform, ScrollView } from 'react-native';
import { Container, Content, ListItem, Tab, Tabs } from 'native-base';
import HTML from 'react-native-render-html';

import style, { RightList, LeftList, UrlLink } from './Styles';

export default class CertificationScreen extends React.Component {
  static navigationOptions = {
    title: ' مقدمة للدراسة',
  };

  componentDidMount() {
    setTimeout(this._tabs.goToPage.bind(this._tabs, 2));
  }

  render() {
    return (
      <Container>
        <Tabs ref={component => (this._tabs = component)} initialPage={0}>
          <Tab heading="القبول والتسجيل">
            <Study />
          </Tab>
          <Tab heading="معاهد اللغة">
            <School navigation={this.props.navigation} />
          </Tab>
          <Tab heading="مقدمة">
            <SchoolApplication />
          </Tab>
        </Tabs>
      </Container>
    );
  }
}

class School extends React.Component {
  render() {
    let navigation = this.props.navigation;
    return (
      <Content padder>
        <Text style={style.title}>قائمة معاهد اللغة اليابانية الموصى بها</Text>
        
        <Text style={style.jparagraph}>
          · Intensive Japanese Language Program For Overseas Students <UrlLink url="https://language.takushoku-u.ac.jp/english/student_program/isp.html" navigation={navigation}>(IJLP), Takushoku University</UrlLink>{'\n'}
          · Japanese Language Course for Foreign Students, <UrlLink url="http://www.u-tokai.ac.jp/international/undergraduate/japanese_language_course.html" navigation={navigation}>Tokai University</UrlLink>{'\n'} 
          · Japanese Language School affiliated with TOKYO UNIVERSITY of TECHNOLOGY, <UrlLink url="http://www.jst.ac.jp/us/index.html" navigation={navigation}>KATAYANAGI INSTITUTE</UrlLink>{'\n'}
          · Japanese Language Education Center - <UrlLink url="http://www.jasso.go.jp/tokyo/index_e.html" navigation={navigation}>JASSO Tokyo</UrlLink>{'\n'}
          · Japanese Language Education Center - <UrlLink url="http://www.jasso.go.jp/ojlec/index_e.html" navigation={navigation}>JASSO Osaka</UrlLink>{'\n'}
          · <UrlLink url="http://school.kokusho.co.jp/en/school_info/school_outline.html" navigation={navigation}>Kokusho</UrlLink> Japanese Language School{'\n'}
          · <UrlLink url="http://en.saisc.jp/" navigation={navigation}>Saitama</UrlLink> International School{'\n'}
          · <UrlLink url="http://www.jp-sjs.ac.jp/eng/index.html" navigation={navigation}>Sendagaya</UrlLink> Japanese School{'\n'}
          · <UrlLink url="http://www.sng.ac.jp/english/index.html" navigation={navigation}>Shinjuku</UrlLink> Japanese Language{'\n'}
          · <UrlLink url="http://www.uiec.jp/" navigation={navigation}>Institute Urawa</UrlLink> International Education Center{'\n'}
          · <UrlLink url="http://www.ehle.ac.jp/" navigation={navigation}>Ehle Institute</UrlLink> Japanese Language School{'\n'}
          · <UrlLink url="http://www.naganuma-school.ac.jp/" navigation={navigation}>The Naganuma School Tokyo</UrlLink> School of Japanese Language{'\n'}
          · <UrlLink url="http://hajl.athuman.com/access/?code=130071#access02" navigation={navigation}>Osaka</UrlLink> – Human Academy Japanese Language School{'\n'}
          · <UrlLink url="http://www.isi-education.com/" navigation={navigation}>ISI</UrlLink> Japanese Language School{'\n'}
        </Text>
      </Content>
    );
  }
}

class Study extends React.Component {
  render() {
    return (
      <Content padder>
        <Text style={style.title}>مقدمة للدراسة باليابان</Text>
        <Text style={style.header}>
          يسر الملحقية الثقافية السعودية في اليابان أن تقدم المعلومات التالية عن الدراسة في اليابان والتسهيلات التي يمكن للملحقية
          القيام بها.
        </Text>
        <Text style={style.header}>مقدمة مهمة للدراسة في اليابان:</Text>
        <Text style={style.paragraph}>
          تبدأ الدراسة عادة في شهر أبريل من كل عام ويمكن أن تبدأ الدراسة في بعض الجامعات في شهر سبتمبر، واللغة اليابانية هي اللغة
          الوحيدة المستخدمة في الحياة اليومية في اليابان. تتم الدراسة في الجامعات باللغة اليابانية، وخصوصاً في مرحلة البكالوريوس
          حتى للتخصصات الطبية والعلوم الصحية.
        </Text>
        <Text style={style.paragraph}>تساعد الملحقية في إحضار القبول لدراسة اللغة اليابانية من معاهد اللغة الموصى بها</Text>
        <Text style={style.paragraph}>(رابط معاهد اللغة الموصى بها)</Text>
        <Text style={style.paragraph}>
          {' '}
          والتي تبدأ الدراسة فيها بشهر أبريل أو أكتوبر، كذلك يمكن الملحقية المساعدة في تسهيل الحصول على التأشيرة الدراسية
          اليابانية بالتنسيق مع معاهد اللغة الموصى بها.
        </Text>
        <Text style={style.paragraph}>
          مدة دراسة اللغة اليابانية تتراوح من سنة إلى سنتين وخلال السنة الأخيرة من فترة اللغة يبدأ الطالب بالتقديم على الجامعات
          للحصول على قبول أكاديمي بعد أن يكون قد حقق تقدماً ملحوظاً في اللغة، وبالطبع لكل جامعة شروطها والملحقية تساعد المبتعثين
          والدارسين على حسابهم الخاص للحصول على القبول الأكاديمي نظراً لوجود علاقات جيدة مع بعض الجامعات. علماً أن التقديم على
          الجامعات يبدأ قبل فترة من بداية الدراسة تتراوح من 5 أشهر وتصل في بعض الجامعات إلى 9 أشهر خصوصا للطلاب الدوليين المتقدمين
          من خارج اليابان.
        </Text>
        <Text style={style.paragraph}>
          وبحسب النظام العام للتعليم العالي في اليابان لا تقدم الجامعات مقاعد دراسية لطلاب معينين وإنما تكون المقاعد خاضعة
          للمنافسة ‏الأكاديمية بين جميع الطلاب، ولكن بتوفيق الله ثم اجتهاد المبتعثين السعوديين والتزامهم الدراسي وإشراف الملحقية
          ‏ومساعدتها فإن كل المبتعثين تقريباً تمكنوا سابقاً من الحصول على قبول أكاديمي في المراحل الجامعية المختلفة.
        </Text>
        <Text style={style.header}>الدراسة في اليابان باللغة الإنجليزية:</Text>
        <Text style={style.paragraph}>
          حسب أنظمة الإدارة العامة لمعادلة الشهادات الجامعية فإن الدراسة في اليابان يجب أن تكون باللغة اليابانية. علماً أن اليابان
          تفتقر الى معاهد اللغة الانجليزية التي تقدم برامج لغة انجليزية لغرض الدراسة الأكاديمية ويوجد حالياً معهدان موصى بهما
          الأول في جامعة “تمبل-اليابان” ، والثاني في جامعة “ليكلاند” كلاهما بمدينة طوكيو يدرس فيها أبناء وزوجات الموفدين
          السعوديين. ويوجد عدد قليل جداً من الجامعات الموصى بها لديها بعض تخصصات مرحلة البكالوريوس تدرس باللغة الانجليزية ويزداد
          هذا العدد من البرامج في مرحلة الدراسات العليا إلا أنه يخضع للموافقة المسبقة من الأستاذ المشرف على كتابة التقارير
          الدراسية وبحث تخرج الماجستير والدكتوراه باللغة الإنجليزية. وعادة تشترط هذه الجامعات مستويات مرتفعة في اللغة الإنجليزية.
        </Text>
        <Text style={style.header}>وللمعلومات التفصيلية عن التسجيل في معاهد اللغة والجامعات نأمل الاطلاع على الرابط التالي:</Text>
        <Text style={style.paragraph}>رابط معلومات التسجيل في معاهد اللغة والجامعات</Text>
        <Text style={style.paragraph}>الإيميل: students@saudiculture.jp</Text>
        <Text style={style.paragraph}>الهاتف: 81353483011+</Text>
        <Text style={style.paragraph}>الفاكس: 81353483012+</Text>
        <Text style={style.paragraph}>مواعيد عمل ملحقية اليابان: من 09:30 صباحا إلى 16:30 مساء بتوقيت طوكيو</Text>
        <Text style={style.paragraph}>(توقيت اليابان يسبق توقيت المملكة بـ 6 ساعات)</Text>
      </Content>
    );
  }
}

class SchoolApplication extends React.Component {
  render() {
    return (
      <Content padder>
        <Text style={style.title}>القبول والتسجيل في معاهد اللغة والجامعات اليابانية</Text>
        <Text style={style.header}>خطوات الدراسة في اليابان:</Text>
        <Text style={style.paragraph}>
          نظام التعليم الجامعي للأجانب في اليابان مصمم بشكل أساسي على حضور الطالب إلى اليابان لدراسة اللغة اليابانية أولاً ثم
          الالتحاق بمؤسسات التعليم العالي.
        </Text>
        <Text style={style.header}>أولا) الالتحاق بمعاهد اللغة:</Text>
        <Text style={style.paragraph}>
          الدراسة في معظم الجامعات اليابانية تتم باللغة اليابانية لذا معظم الطلاب الأجانب يبدؤون مسيرتهم الدراسية من معاهد اللغة
          اليابانية حيث تساعد معاهد اللغة اليابانية الطلبة الأجانب على التأقلم مع المعيشة في اليابان واجتياز حاجز اللغة والتأهل
          لدخول الجامعة. وتُشرف الملحقية الثقافية على برنامج دراسة اللغة للمبتعثين السعوديين في اليابان والتي تتراوح مدتها من سنة
          إلى سنتين حيث يدرس فيها الطالب بجانب اللغة اليابانية مواداً علمية كالرياضيات والفيزياء والكيمياء والأحياء تحضره للاختبار
          الخاص بالطلاب الأجانب للتقديم على الجامعات اليابانية والمعروف بـ “Examination for Japanese University Admission for
          International Students (EJU)” والذي يقام باللغة اليابانية مرتين في السنة في شهري يونيو ونوفمبر.
        </Text>
        <Text style={style.paragraph}>
          كذلك في الأسبوع الأول من شهري يوليو وديسمبر من كل عام يقام اختبار قياس الكفاءة في اللغة اليابانية والمعروف بـ (JLPT)
          لخمسة مستويات أعلاها المستوى الأول، ويعد اجتياز المستوى الأول (وأحيانا الثاني) شرطا لدخول الجامعات المتميزة.
        </Text>
        <Text style={style.paragraph}>
          وللالتحاق بمعاهد اللغة ينبغي على الطالب القيام بالخطوات التالية قبل القدوم إلى اليابان:
        </Text>
        <RightList>
          جمع المعلومات عن المعاهد المتاحة والمدينة التي بها مقر المعهد المفضل ووضع خطة دراسية مناسبة لمستوى الطالب وظروفه.
        </RightList>
        <RightList>
          إرسال الوثائق التالية لمعهد اللغة: الوثائق الشخصية مثل جواز السفر، الشهادة الدراسية لأخر مرحلة انجزها الطالب مترجمة إلى
          اللغة الإنجليزية بواسطة جهة معترف بها أو مكتب معتمد، بالنسبة للدارسين على حسابهم الخاص إفادة براتب ولي أمر الطالب أو
          إفادة برصيد بنكي يحدده المعهد.
        </RightList>
        <RightList>
          الحصول على القبول من معهد دراسة اللغة (بالنسبة للمبتعثين يتم التواصل مع الملحقية للتنسيق المباشر مع معاهد اللغة للحصول
          على القبول)، ثم يبدأ المعهد في إجراءات إصدار التأشيرة الدراسية للطالب بالحصول على شهادة الأهلية للإقامة وإرسالها إلى
          عنوان الطالب في المملكة.
        </RightList>
        <RightList>
          الحصول على التأشيرة من السفارة اليابانية بالرياض أو من القنصلية اليابانية بجدة والتنسيق مع المعهد بشأن السكن، ثم السفر
          إلى اليابان مع ضرورة إبلاغ المعهد ليتم استقبال المبتعث في المطار.
        </RightList>
        <RightList>
          إتمام إجراءات القبول والتسجيل بالمعهد وبالطبع إتمام إجراءات التسجيل في مكاتب البلدية والاشتراك في التأمين الصحي وغير ذلك
          من الإجراءات الروتينية.
        </RightList>
        <Text style={style.paragraph}>
          أثناء الدراسة بمعهد اللغة ينبغي على الطالب البحث عن الجامعات والكليات التي يرغب الالتحاق بها وإعداد جميع الوثائق
          والشهادات المطلوبة للتسجيل. ينبغي على الطالب قبل انتهاء المدة النظامية لدراسة اللغة اليابانية (سنتان) أو التخرج من معهد
          اللغة اليابانية الحصول على القبول الأكاديمي من مؤسسة تعليمية موصى بها في تخصص الطالب بحسب جميع الشروط الواردة في قرار
          ابتعاث الطالب حتى لا تكون هناك مرحلة انقطاع بين مرحلة اللغة والمرحلة الاكاديمية والتي تصاحبها صعوبات قد يواجهها الطالب
          بحسب النظام الياباني.
        </Text>
        <Text style={style.header}>ثانيا) التقديم على الجامعات:</Text>
        <Text style={style.paragraph}>
          توجد الكثير من الوثائق والشهادات اللازمة للتقديم للالتحاق بالجامعات. لذا ينبغي على الطالب تجهيز تلك الوثائق وإحضارها على
          أن تكون معتمدة وباللغة الإنجليزية.
        </Text>
        <Text style={style.header}>أ- الوثائق المطلوبة لجميع المراحل:</Text>
        <RightList>
          الوثائق الشخصية مثل جواز السفر، وبطاقة الإقامة الدراسية اليابانية (للطلاب المتواجدين في اليابان بإقامة دراسية).
        </RightList>
        <RightList>
          اعتماد أوراق التقديم للجامعة من الملحقية في خانة الضامن بالنسبة للمبتعث. وبالنسبة للدارس على حسابه الخاص فيختلف الأمر من
          جامعة لأخرى، حيث يطلب بعضها ضمانا ماليا شخصيا براتب ولي أمر الطالب، أو برصيد في البنك تحدده الجامعة أو معهد اللغة، ومعظم
          الجامعات اليابانية الحكومية تطلب تحديد أحد الأشخاص المقيمين في اليابان ويمكن الوصل إليه ليكون ضامنا شخصيا للطالب،
          والجامعات الخاصة تطلب بالإضافة إلى ذلك تعبئة بيانات الشخص الذي سوف يتحمل دفع الرسوم الدراسية وعلاقته بالطالب.
        </RightList>
        <RightList>
          خطابات توصية (يختلف عددها بحسب كل جامعة) من قبل معهد اللغة اليابانية أو المدرسة الثانوية / الجامعة التي تخرج منها الطالب
          المتقدم (نقترح توفير 3 خطابات توصية لكل جامعة يتم التقديم عليها).
        </RightList>
        <RightList>
          دفع رسوم التقديم لاختبار الجامعة وتقديم إيصال الدفع ضمن الأوراق كشرط لقبولها (يتم تعويض المبتعثين عنها لاحقا من قبل
          الملحقية).
        </RightList>
        <Text style={style.header}>ب – طلاب مرحلة البكالوريوس:</Text>
        <Text style={style.paragraph}>
          دراسة البكالوريوس في اليابان تتم باللغة اليابانية في معظم الجامعات، ويتم التقديم للالتحاق بمعظم الجامعات ورقيا إما
          بإرسال الأوراق بالبريد أو بقيام الطالب بتسليمها شخصيا إلى قسم القبول والتسجيل بالجامعة بعد استيفاء الشروط والأوراق
          المطلوبة، وخلال المدة المحددة لقبول أوراق التقديم.
        </Text>
        <Text style={style.paragraph}>
          تمر عملية التقديم بأكثر من مرحلة، المرحلة الأولى هي فحص الأوراق المقدمة، ومن استوفت أوراقهم الشروط المحددة من قبل
          الجامعة يتم إبلاغهم برقم المتقدم وموعد ومكان الاختبار. توجد ببعض الجامعات اختبارات تحريرية مع المقابلة الشخصية، وهناك
          بعض الجامعات التي تكتفي بالمقابلة الشخصية فقط علما أن الاختبارات والمقابلة الشخصية تتم جميعها باللغة اليابانية إلا في
          خلاف ذلك من برامج الدراسة باللغة الإنجليزية.
        </Text>
        <Text style={style.paragraph}>
          من يجتاز الاختبارات والمقابلة الشخصية يتم إخطاره بالقبول رسميا وتبدأ بعدها إجراءات التسجيل (وطلب التقديم على التأشيرة
          لمن هم في حاجة إليها).
        </Text>
        <Text style={style.paragraph}>
          وفيما يلي الأوراق المطلوبة لمرحلة البكالوريوس بالإضافة إلى الأوراق المذكورة في الجزء ”{' '}
          <Text style={style.arabicBold}>أ. الوثائق المطلوبة لجميع المراحل</Text>” أعلاه:
        </Text>
        <RightList>
          بيان درجات الصف الأول والثاني والثالث الثانوي (الشهادات المقدمة يجب أن تكون شهادات أصلية بالإضافة إلى ضرورة ترجمتها إلى
          اللغة الإنجليزية بواسطة جهة معترف بها أو مكتب معتمد)، بالإضافة إلى شهادة يتم إصدارها باللغة اليابانية من الملحقية تفيد
          بحصول الطالب على الثانوية العامة أو ما يعادلها.
        </RightList>
        <RightList>
          شهادات التقدم لاختبار الجامعات اليابانية EJU، وكذلك اختبار قياس الكفاءة في اللغة اليابانية JLPT. حيث يوجد عدد من
          الجامعات وخصوصا المتميزة تشترط التقدم للاختبارين والحصول على درجات ومستويات محددة لقبول أوراق التقدم وخصوصا لمرحلة
          البكالوريوس (وبعض الجامعات لا تطلب مستويات محددة بل تكتفي بالاختبارات التي يتم إجراؤها في الجامعة).
        </RightList>
        <Text style={style.header}>ج – طلاب مرحلة الماجستير:</Text>
        <Text style={style.paragraph}>
          بالنسبة لمرحلة الماجستير فإن مدة الدراسة فيها سنتين، وآلية القبول فيها تختلف عن البكالوريوس حيث يتم التواصل المباشر من
          قبل الطالب مع الأستاذ الأكاديمي في الجامعة والذي يتوافق تخصص الطالب مع تخصصه ليكون مشرفاً على دراسته. وفي حالة قيام
          الأستاذ بالرد فقد يكون ذلك مؤشرا لاهتمامه بالطالب وموضوع بحثه، وفي بعض الحالات لا يقوم الأستاذ بالرد ما يعني عدم اهتمامه
          وضرورة البحث عن مكان آخر.
        </Text>
        <Text style={style.paragraph}>
          في بعض الجامعات لا يفضل الأستاذة تواصل الطلاب معهم مباشرة، ويتم توضيح الجهة التي يمكن التواصل معها في الجامعة ووسيلة
          التواصل ليتم إيصال بيانات وموضوع الطالب إلى الأستاذ من خلالها. وقد تطلب بعض الجامعات من الطالب التقديم مباشرة دون
          التواصل المسبق مع الأستاذ الأكاديمي ليتم التقييم من خلال الاختبارات الرسمية دون التنسيق المسبق مع الأستاذ المشرف، تتبع
          عملية قبول أوراق الطالب خضوع الطالب لاختبارات تحريرية ومقابلة شخصية وتقديم سيمنار كلها مجتمعة أو بعضها وتختلف من جامعة
          إلى أخرى.
        </Text>
        <Text style={style.paragraph}>
          الدراسة في الماجستير تعتمد على البحث العلمي بالإضافة إلى بعض المقررات، حيث تصل عدد الساعات المطلوبة للتخرج إلى 30 ساعة
          كحد أدنى في معظم الجامعات شاملة ساعات بحث الماجستير خلال فترة السنتين المطلوبة للتخرج.
        </Text>
        <Text style={style.paragraph}>
          الدراسة في مرحلة الماجستير تتم باللغة اليابانية (ولكن هناك القليل من الجامعات يمكن الدراسة فيها باللغة الإنجليزية) وفي
          حالة المقررات التي تدرس باللغة اليابانية قد يتم الاتفاق أحياناً مع الأستاذ المشرف على الطالب ليتم السماح للطالب بكتابة
          وتقديم التقارير الدراسية والأبحاث باللغة الإنجليزية.
        </Text>
        <Text style={style.paragraph}>نوع القبول في مرحلة الماجستير ينقسم إلى قسمين:</Text>
        <Text style={style.paragraph}>
          <Text style={style.arabicBold}>1</Text>: القبول الرسمي المباشر والنهائي للماجستير لتكون مدة الدراسة سنتان.
        </Text>
        <Text style={style.paragraph}>
          <Text style={style.arabicBold}>2</Text>: القبول كـ “طالب باحث – Research Student” وهو بمثابة تمهيدي ماجستير تصل مدته من
          6 أشهر إلى سنة يلتحق به الكثير من الطلاب الأجانب، ويكون الحصول على القبول في هذه المرحلة التمهيدية أكثر سهولة والشروط
          المطلوبة للقبول به أقل من شروط القبول الرسمي للماجستير. علما أنه خلال فترة الطالب الباحث يتعرف الطالب على القسم والمعمل
          البحثي وكذلك يتأكد الأستاذ الأكاديمي من قدرات الطالب الشخصية والعلمية والبحثية ومن موضوعه البحثي ليتم الإعداد لقبوله
          كطالب رسمي في الماجستير، حيث يتم التقديم من جديد للالتحاق ببرنامج الماجستير خلال فترة الطالب الباحث.
        </Text>
        <Text style={style.paragraph}>
          وفيما يلي الأوراق المطلوبة لطلاب الماجستير بالإضافة إلى الأوراق المذكورة في الجزء ”{' '}
          <Text style={style.arabicBold}>أ. الوثائق المطلوبة لجميع المراحل</Text> “:
        </Text>
        <RightList>
          أصل شهادة التخرج وكشف الدرجات بالإنجليزية (شهادات البكالوريوس لطلاب الماجستير، في حالة الشهادات باللغة العربية يجب
          ترجمتها إلى اللغة الإنجليزية من مكاتب ترجمة معتمدة ويفضل تجهيز أكثر من ثلاث نسخ).
        </RightList>
        <RightList>
          الشهادات التي تفيد بمستوى الطلاب الذين ينوون الدراسة باللغة الإنجليزية بالبرامج الدراسية باللغة الإنجليزية، مع ضرورة
          التأكد من انطباق شروط المستوى اللغوي المطلوب بكل جامعة.
        </RightList>
        <RightList>خطة بحث توضح مضمون البحث العلمي الذي يرغب فيه الطالب.</RightList>
        <Text style={style.header}>ج – طلاب مرحلة الدكتوراه:</Text>
        <Text style={style.paragraph}>
          بالنسبة لمرحلة الدكتوراه آلية القبول فيها تشبه نسبيا مرحلة الماجستير، بالنسبة لمرحلة الدكتوراه مدة الدراسة فيها 3 سنوات،
          وآلية القبول فيها إما أن تتم بالتواصل المباشر من قبل الطالب مع الأستاذ الأكاديمي في الجامعة والذي يتوافق تخصص الطالب مع
          تخصصه ليكون مشرفاً على دراسته، وفي حالة قيام الأستاذ بالرد فقد يكون ذلك مؤشرا لاهتمامه بالطالب وموضوع بحثه، وفي بعض
          الحالات لا يقوم الأستاذ بالرد ما يعني عدم اهتمامه وضرورة البحث عن مكان آخر. في بعض الجامعات لا يفضل الأستاذة تواصل
          الطلاب معهم مباشرة، ويتم توضيح الجهة التي يمكن التواصل معها في الجامعة ووسيلة التواصل ليتم إيصال بيانات وموضوع الطالب
          إلى الأستاذ من خلالها. وقد تطلب بعض الجامعات من الطالب التقديم مباشرة دون التواصل المسبق مع الأستاذ الأكاديمي ليتم
          التقييم من خلال الاختبارات الرسمية دون التنسيق المسبق مع الأستاذ المشرف، تتبع عملية قبول أوراق الطالب خضوع الطالب
          لاختبارات تحريرية ومقابلة شخصية وتقديم سيمنار كلها مجتمعة أو بعضها وتختلف من جامعة الى أخرى.
        </Text>
        <Text style={style.paragraph}>
          الدراسة في الدكتوراه تعتمد على البحث العلمي بالإضافة إلى بعض المقررات، حيث تتفاوت الساعات المطلوبة من جامعة لأخرى مع
          ضرورة كتابة ونشر أبحاث في مجلات علمية محلية ودولية علما أن مدة الدراسة في معظم برامج الدكتوراه 3 سنوات كحد أدنى.
        </Text>
        <Text style={style.paragraph}>
          الدراسة في مرحلة الدكتوراه تتم باللغة اليابانية (ولكن هناك القليل من الجامعات يمكن الدراسة فيها باللغة الإنجليزية) وفي
          حالة المقررات التي تدرس باللغة اليابانية قد يتم الاتفاق أحياناً مع الأستاذ المشرف على الطالب ليتم السماح للطالب بكتابة
          وتقديم التقارير الدراسية والأبحاث باللغة الإنجليزية.
        </Text>
        <Text style={style.paragraph}>نوع القبول في مرحلة الدكتوراه ينقسم إلى قسمين:</Text>
        <Text style={style.paragraph}>
          <Text style={style.arabicBold}>1</Text>: القبول الرسمي المباشر والنهائي للدكتوراه لتكون مدة الدراسة 3 سنوات.
        </Text>
        <Text style={style.paragraph}>
          <Text style={style.arabicBold}>2</Text>: القبول كـ “طالب باحث – Research Student” وهو بمثابة تمهيدي دكتوراه تصل مدته من
          6 أشهر إلى سنة يلتحق به الكثير من الطلاب الأجانب، ويكون الحصول على القبول في هذه المرحلة التمهيدية أكثر سهولة والشروط
          المطلوبة للقبول به أقل من شروط القبول الرسمي للدكتوراه. علما أنه خلال فترة الطالب الباحث يتعرف الطالب على القسم والمعمل
          البحثي وكذلك يتأكد الأستاذ الأكاديمي من قدرات الطالب الشخصية والعلمية والبحثية ومن موضوعه البحثي ليتم الإعداد لقبوله
          كطالب رسمي في الدكتوراه، حيث يتم التقديم من جديد للالتحاق ببرنامج الدكتوراه خلال فترة الطالب الباحث.
        </Text>
        <Text style={style.paragraph}>
          وفيما يلي الأوراق المطلوبة لطلاب الدكتوراه بالإضافة إلى الأوراق المذكورة في الجزء ”{' '}
          <Text style={style.arabicBold}>أ. الوثائق المطلوبة لجميع المراحل</Text> “:
        </Text>
        <RightList>
          أصل شهادة التخرج وكشف الدرجات بالإنجليزية (شهادات الماجستير لطلاب الدكتوراه، في حالة الشهادات باللغة العربية يجب ترجمتها
          إلى اللغة الإنجليزية من مكاتب ترجمة معتمدة ويفضل تجهيز أكثر من ثلاث نسخ).
        </RightList>
        <RightList>
          الشهادات التي تفيد بمستوى الطلاب الذين ينوون الدراسة باللغة الإنجليزية بالبرامج الدراسية باللغة الإنجليزية، مع ضرورة
          التأكد من انطباق شروط المستوى اللغوي المطلوب بكل جامعة.
        </RightList>
        <RightList>خطة بحث توضح مضمون البحث العلمي الذي يرغب فيه الطالب.</RightList>
        <RightList>
          ملخص لبحث الماجستير باللغة الإنجليزية، وقائمة بأسماء الأبحاث العلمية المنشورة وغيرها من إنجازات علمية وخبرات -إن وجدت-.
        </RightList>
      </Content>
    );
  }
}
