export default {
  durusiyah: `^ الشؤون الدراسية
= كيف أستطيع الالتحاق بالبعثة
ضوابط وشروط إلحاق الطالب الدارس على حسابه الخاص بالبعثة
- أن يكون حاصلاً على موافقة الوزارة المسبقة على الدراسة.
- أن يكون حسن السيرة والسلوك.
- ألا يكون قد سبق فصله من البعثة.
- أن يكون مقيماً في بلد الدراسة ومتفرغاً لدراسته.
- أن تكون المؤسسة التعليمية موصى بها من قبل الوزارة.
- أن يكون تخصصه الدراسي ضمن التخصصات المعتمدة من الوزارة.
- أن تكون دراسته تحت إشراف الملحقية.
= كيف أستطيع الحصول على قبول من إحدى معاهد اللغة
اللغة اليابانية هي اللغة الوحيدة المستخدمة في الحياة اليومية اليابانية ولا غنى عنها في التعاملات اليومية أما في الجامعات فكما سبق الذكر مرحلة البكالوريوس تكون الدراسة فيها باللغة اليابانية أما المراحل الأعلى فيمكن فيها الدراسة باللغة الإنجليزية مع ضرورة تعلم اللغة اليابانية لأهميتها في التعاملات داخل الجامعة وخارجها ولأهميتها في بعض المحاضرات التي تستخدم فيها اللغة اليابانية ولو بشكل جزئي.

وبالنسبة لمتطلبات القبول بمعاهد اللغة فتتمثل في أن يكون الطالب حاصل على الثانوية العامة فما فوق، وأن يكون لديه القدرة التحصيلية للاستمرار في دراسة اللغة اليابانية والحضور بانتظام وبالنسبة للطلبة الدارسين على حسابهم الخاص يطلب منهم ضمانات تثبت قدرتهم على سداد الرسوم الدراسية والمعيشة في اليابان وضامن يمكن التواصل معه في حالة حدوث أية مشكلة وهذه الأمور التي تقوم بها الملحقية في حالة كون الطالب مبتعثا حيث يتم تقديم الأوراق والحصول على القبولات للمرشحين للابتعاث قبل قدومهم إلى اليابان بفترة ليتم تسريع إجراءات إصدار التأشيرات. وفي حالة إلحاق الطالب بالبعثة تقوم الملحقية بتغطية بتحمل مسؤولية الطالب ماليا وتقديم الرعاية والدعم المطلوب.

بالنسبة لمعاهد اللغة ومستوياتها فالملحقية –وتحديدا قسما الإشراف الأكاديمي والتعاون الدولي بالمحلقية- تركز منذ النشأة على فتح علاقات واسعة مع الجامعات والمعاهد المتميزة ويتم قبول الطلاب السعوديين لدراسة اللغة في عدد من أفضل المعاهد باليابان والتي وبالإضافة للتميز الأكاديمي فإنها تتعاون بصور مختلفة في الرعاية الاجتماعية للطلاب والدعم الخاص بكل طالب في حالة وجود حالات متعثرة في دراسة اللغة أو في المواد العلمية التخصصية من خلال إعداد دروس تقوية ومتابعة فردية لكل طالب حسب الحاجة.

الاسباب التي يوجه فيها  للمبتعث أو المبتعثة في مرحلة اللغة إنذاراً أكاديمياً:
1. ارتفاع نسبة الغياب بدون أعذار مقبولة (في حالة احتمال طول مدة الغياب يُفضل أن يقوم الطالب بالرفع لطلب تأجيل البعثة وتأجيل الدراسة بالتنسيق مع الجامعة).

2. عدم تسجيل العدد الكافي من الساعات الدراسية المطلوبة للتخرج في مطلع كل فصل دراسي.

3. عدم تقديم كشف الدرجات إلى الملحقية عند طلبه.

4. تدني مستوى الدراسة وانخفاض المعدل التراكمي/الفصلي، أو الرسوب.

5. التأخر في العودة إلى مقر البعثة خلال فترة الدراسة بدون عذر مقبول.

6. المخالفات السلوكية أو مخالفة قوانين بلد الابتعاث أو الجامعة/المعهد.

7. عدم رد الطالب على الاتصالات الهاتفية أو الإيميلات الموجهة إليه من الجامعة/المعهد أو الملحقية.

8. مغادرة بلد الابتعاث بدون موافقة الملحقية أو الجامعة/المعهد.

9. غير ذلك من أسباب أخرى تراها الملحقية بحسب الأنظمة واللوائح.`,
  maaliyah: `^ الشؤون المالية
= ما هي الحالات التي يتوقف فيها الصرف على المبتعث؟

يوقف الصرف على المبتعث في الحالات التالية:
- تخرّج المبتعث وحصوله على الدرجة المبتعث من أجلها.
- إنتهاء مدة البعثة.
- إنتهاء سنتين اللغة دون الحصول على قبول جامعي.
- رسوب الطالب في المرحلة الأكاديمية في جميع المواد لفصلين دراسيين متتاليين.
- حذف الطالب أو انسحابه من الفصل الدراسي دون الرجوع للملحقية.
- حصول المبتعث على إنذارين وعدم تعهده ببذل مزيد من الجد وأنه على علم بأن حصوله على الانذار الثالث سوف يؤدي إلى الرفع بإنهاء البعثة.
- حصول المبتعث على ثلاثة إنذارات أكاديمية.
- تغيير المبتعث للمعهد أو الجامعة دون موافقة الملحقية.
- تغيير المبتعث للتخصص دون الموافقة عليه من الملحقية أو جهة الإبتعاث.
- تغيير المبتعث للدرجة العلمية دون موافقة الملحقية أو جهة الإبتعاث.
- انقطاع المبتعث عن الدراسة دون عذر تقبله الملحقية.
- فصل المبتعث نهائياً من المؤسسة التعليمية لأسباب أكاديمية أو تأديبية.
- الفصل المؤقت للمبتعث من المؤسسة التعليمية أو وضعه على فترة متابعة.
- ترك المبتعث مقر الدراسة لأي سبب دون علم الملحقية.
- تأخر رجوع المبتعث إلى مقر الدراسة بعد الاجازة.
- عدم تسليم التقارير الدراسية وإفادات التسجيل والخطة الدراسية في الوقت المحدد.
- قيام المبتعث بتصرفات مخالفة للتعاليم الدينية أو الأخلاق التي يجب أن يتميز بها المبتعث السعودي.
- الحصول على جنسية أخرى أو الحصول على الإقامة الدائمة، تمهيداً للحصول على الجنسية.
- مغادرة محرم المبتعثة مقر البعثة لأي سبب دون علم وموافقة الملحقية.
- مخالفة أنظمة الابتعاث أو الامتناع عن تنفيذها.
`,
  ibtiats: `^ وكالة الابتعاث
= مقدمة :
تنفيذ للخطط و​السياسات والضوابط الخاصة بتسجيل براءات الإختراع داخل المملكة وبالتعاون مع مدينة الملك عبدالعزيز للعلوم والتقنية ممثلة بمكتب البراءات السعودي​، بشأن تسجيل براءات الإختراع الخاصة بالطلاب والطالبات المبتعثين خارج المملكة، فيسر وزارة التعليم ممثلة بوكالة الوزارة لشؤون البعثات تقديم رابط تسجيل براءات الاختراع داخل المملكة على موقع الوكالة ومواقع الملحقيات الثقافية على الشبكة العنكبوتية، لتسهيل الوصول والتسجيل لدى مكتب البراءات السعودي.​

 

= نبذة عن مكتب البراءات السعودي :
بدأت مدينة الملك عبد العزيز للعلوم والتقنية​ في متابعة ما يتعلق ببراءات الاختراع بعد إشعارها عام 1402هـ بالأمر السامي الكريم القاضي بالموافقة على انضمام المملكة إلى المنظمة العالمية للملكية الفكرية (ويبو) على اعتبار أن موضوع الملكية الفكرية يتعلق أساسا بتسجيل براءات الاختراع وتنظيم أمور نقل التقنية وأن مدينة الملك عبدالعزيز للعلوم والتقنية تختص بهذه المهمة لكونها الجهة المؤهلة علميا وعمليا لذلك .
وصدر أول نظام براءات اختراع في المملكة بموجب المرسوم الملكي رقم (م/38) وتاريخ 1409/6/10 هـ (الموافق 1989/1/18 م) ونص على أنه يهدف إلى توفير الحماية الكاملة للاختراعات داخل المملكة، وقد انتهى العمل به في 1425/7/19 هـ (الموافق 2004/9/4 م).
وصدر “نظام براءات الاختراع والتصميمات التخطيطية للدارات المتكاملة والأصناف النباتية والنماذج الصناعية" بموجب المرسوم الملكي رقم (م/27) وتاريخ 1425/5/29 هـ (الموافق 2004/7/17 م). وتم نشره في الجريدة الرسمية (أم القرى) في 1425/6/20 هـ (الموافق 2004/8/7 م)، وأصبح نافذا بتاريخ 1425/7/20 هـ (الموافق 2004/9/5 م).
والملكية الصناعية هي أحد فروع الملكية الفكرية، وتعنى بحفظ حقوق ما يبتكره فكر الإنسان من المصنفات أو العناصر ذات الاتصال بالنشاط الصناعي والتجاري والزراعي، ومجالاتها:
الاختراعات
النماذج الصناعية
الأصناف النباتية
التصميمات التخطيطية للدارات المتكاملة
العلامات التجارية
البيانات الجغرافية
وقد أوكل لمدينة الملك عبد العزيز للعلوم والتقنية ممثلة بمكتب البراءات السعودي تولي حماية أربعة أقسام منها هي الاختراعات والتصميمات التخطيطية للدارات المتكاملة والأصناف النباتية والنماذج الصناعية.
( المصدر : مكتب البراءات السعودي )
= الأهداف من انشاء مكتب البراءات السعودي :
الهدف من إنشاء مكتب البراءات السعودي هو توفير الحماية للاختراعات والتصميمات التخطيطية للدارات المتكاملة والأصناف النباتية والنماذج الصناعية في المملكة. ( المصدر : مكتب البراءات السعودي )
= المهام المناطة إلى مكتب البراءات السعودي :
​تنفيذ ما يتعلق بحماية الاختراعات والتصميمات التخطيطية للدارات المتكاملة والأصناف النباتية والنماذج الصناعية.
إيداع وفحص طلبات الحصول على البراءات للاختراعات والتصميمات التخطيطية للدارات المتكاملة والأصناف النباتية والنماذج الصناعية.
منح البراءات للاختراعات والتصميمات التخطيطية للدارات المتكاملة والأصناف النباتية والنماذج الصناعية.
بناء وتطوير قواعد معلومات وطنية لوثائق الحماية "البراءات" للاختراعات والتصميمات التخطيطية للدارات المتكاملة والأصناف النباتية والنماذج الصناعية للمجالات المسندة لمدينة الملك عبدالعزيز للعلوم والتقنية.
نشر وثائق الحماية "البراءات" للاختراعات والتصميمات التخطيطية للدارات المتكاملة والأصناف النباتية والنماذج الصناعية.
الإسهام في رفع مستوى الإبداع والابتكار بين المواطنين. ( المصدر : مكتب البراءات السعودي )​.
​
​​​​للتقدم بطلب إلكتروني لمكتب براءات الإختراع ​السعودي، أضغط هنا.`,
};
